Tekla.Structures.DrawingInternal.dotGrLevelMarkAttributes_t
.Net counter struct for core level mark attributes data

Tekla.Structures.DrawingInternal.dotGrLevelMarkAttributes_t.CommonAttributes
The common attributes

Tekla.Structures.DrawingInternal.dotGrLevelMarkAttributes_t.Prefix
The prefix

Tekla.Structures.DrawingInternal.dotGrLevelMarkAttributes_t.UsePositiveSignForPositiveLevels
The use positive sign for positive levels

Tekla.Structures.DrawingInternal.dotGrLevelMarkAttributes_t.TextHidden
The text hidden

Tekla.Structures.DrawingInternal.dotGrLevelMarkAttributes_t.Postfix
The postfix

Tekla.Structures.DrawingInternal.dotGrLevelMarkAttributes_t.Unit
The unit

Tekla.Structures.DrawingInternal.dotGrLevelMarkAttributes_t.UseGrouping
The use grouping

Tekla.Structures.DrawingInternal.dotGrLevelMarkAttributes_t.Angle
The angle

Tekla.Structures.DrawingInternal.dotGrLevelMarkAttributes_t.Font
The font

Tekla.Structures.DrawingInternal.dotGrLevelMarkAttributes_t.Frame
The frame

Tekla.Structures.DrawingInternal.dotGrLevelMarkAttributes_t.TransparentBackground
The transparent background

Tekla.Structures.DrawingInternal.dotGrLevelMarkAttributes_t.ArrowHead
The arrow head

Tekla.Structures.DrawingInternal.dotGrLevelMarkAttributes_t.PlacingAttributes
The placing attributes

Tekla.Structures.DrawingInternal.dotGrLevelMarkAttributes_t.ToStruct(Tekla.Structures.Drawing.LevelMark.LevelMarkAttributes)
.Net data to core data.
Attributes: The attributes.

Tekla.Structures.DrawingInternal.dotGrLevelMarkAttributes_t.FromStruct(Tekla.Structures.Drawing.LevelMark.LevelMarkAttributes)
.Net data from core data.
Attributes: The attributes.